<?php
$pyr_data = [
  [
    'code' => 'Q1',
    'description' => 'グレートピレニーズの原産国はどこ？',
    'answer' => 'フランス',
    'choices' => ['スイス', 'フランス', 'スペイン', 'カナダ']
  ],
  [
    'code' => 'Q2',
    'description' => 'グレートピレニーズの被毛（毛の特徴）は？',
    'answer' => 'ダブルコートでふわふわ',
    'choices' => ['短毛で硬い', 'シングルコート', 'ダブルコートでふわふわ', 'ほとんど毛がない']
  ],
  [
    'code' => 'Q3',
    'description' => 'グレートピレニーズの性格に最も当てはまるのは？',
    'answer' => '温厚で警戒心が強い',
    'choices' => ['攻撃的で神経質', '温厚で警戒心が強い', '落ち着きがなく活発', '無関心で孤独を好む']
  ],
  [
    'code' => 'Q4',
    'description' => 'グレートピレニーズの平均体重は？',
    'answer' => '40〜60kg',
    'choices' => ['10〜15kg', '20〜30kg', '40〜60kg', '70kg以上']
  ],
  [
    'code' => 'Q5',
    'description' => '「ピレニーズ」という名前の由来は？',
    'answer' => '原産地の山脈',
    'choices' => ['毛の色', '原産地の山脈', '発見者の名前', '飼い主の国籍']
  ],
  [
    'code' => 'Q6',
    'description' => 'グレートピレニーズのさんちゃんに最も当てはまる職業は？',
    'answer' => 'セラピードック',
    'choices' => ['セラピードック', '麻薬探知犬', '介助犬', '災害救助犬']
  ],
  [
    'code' => 'Q7',
    'description' => 'グレートピレニーズのさんちゃんの嫌いな食べ物は？',
    'answer' => 'にんじん',
    'choices' => ['アイスクリーム', 'メロン', '霜降りステーキ', 'にんじん']
  ],
  [
    'code' => 'Q8',
    'description' => '「さんた」という名前の由来は？',
    'answer' => '3匹目だから',
    'choices' => ['毛の色', 'サンタクロースに似てるから', '3匹目だから', '飼い主の直感']
  ],
  [
    'code' => 'Q9',
    'description' => 'グレートピレニーズのさんちゃんのお食事する定位置は?',
    'answer' => 'ソファーの上',
    'choices' => ['ソファーの上', '犬の食事スペース', '床に座って食べる', '飼い主が口に運ぶ']
  ],
  [
    'code' => 'Q10',
    'description' => 'さんちゃんが我が家にやってきた時の体重は？<br>(弟のこたろうは6.2kg)',
    'answer' => '3kg',
    'choices' => ['5kg', '3kg', '6kg', '8kg']
  ],
  [
    'code' => 'Q11',
    'description' => 'さんちゃんがお散歩の途中で虫に遭遇した時にとった行動は？',
    'answer' => '追いかける',
    'choices' => ['飼い主を見つめる', '吠えてびっくりさせる', 'じ〰︎と経過観察', '追いかける']
  ],
  [
    'code' => 'Q12',
    'description' => 'グレートピレニーズのさんちゃんが気に食わないご飯が出た時の態度は？？',
    'answer' => 'ご飯入れをひっくり返す',
    'choices' => ['ため息をついてゆっくり食べる', '無視して食べない', 'ご飯入れをひっくり返す', 'そもそも文句も言わず食べる']
  ],
  [
    'code' => 'Q13',
    'description' => 'ピレニーズのさんちゃんのおねだりポーズは？',
    'answer' => '座り込みで上目遣い',
    'choices' => ['手をぺろぺろする', '座り込みで上目遣い', '近寄ってきて体をすりすり', 'そもそもおねだりしない']
  ],
  [
    'code' => 'Q14',
    'description' => 'グレートピレニーズのさんちゃんの好きな麺類は？？',
    'answer' => 'マルちゃん焼きそば',
    'choices' => ['日清の塩焼きそば', '明太子スパゲッティ', 'マルちゃん焼きそば', '冷やし中華']
  ],
  [
    'code' => 'Q15',
    'description' => 'さんちゃんが破壊してしまった物の中で、飼い主が1番ショックを受けたものは？？？',
    'answer' => 'ダイニングテーブル',
    'choices' => ['ブランドバック', 'ダイニングテーブル', 'ソファー', 'リビングの壁']
  ],
  [
    'code' => 'Q16',
    'description' => 'さんちゃんが機嫌が悪くなるのはどんな時？？',
    'answer' => '嫌いな食べ物が出た時',
    'choices' => ['弟ばかり可愛がった時', '叩くふりをした時', '雷が鳴った時', '嫌いな食べ物が出た時']
  ],
  [
    'code' => 'Q17',
    'description' => 'さんちゃんの平均お散歩時間は？？',
    'answer' => '1.5時間から2時間',
    'choices' => ['3時間以上', '1.5時間から2時間', '2時間から2.5時間', '30分から1時間']
  ],
  [
    'code' => 'Q18',
    'description' => '飼い主がさんちゃんが苦手なお医者さんに連れていく時、上手く騙すテクニックは？？',
    'answer' => '強制的に連れて行く',
    'choices' => ['おやつでつる', 'お肉食べに行くよ❤️という', 'お散歩だよ❤️という', '強制的に連れて行く']
  ],
  [
    'code' => 'Q19',
    'description' => '飼い主がさんちゃんが苦手なお医者さんに連れていく時、上手く騙すテクニックは？？',
    'answer' => '強制的に連れて行く',
    'choices' => ['おやつでつる', 'お肉食べに行くよ❤️という', 'お散歩だよ❤️という', '強制的に連れて行く']
  ],
  [
    'code' => 'Q20',
    'description' => 'さんちゃんがほかの大型犬と初めてあった時にとる態度は？？',
    'answer' => 'びびって逃げる',
    'choices' => ['びびって逃げる', '戦闘体制に入る', 'とりあえず経過観察', 'メスかオスで態度を変える']
],
[
  'code' => 'Q21',
  'description' => 'さんちゃんがお散歩の時、必ず見るのは？？',
  'answer' => '若い女性を見た時',
  'choices' => ['若い男性を見た時', '食べ物を見た時', '若い女性を見た時', '飼い主だけを見つめる']
],
[
  'code' => 'Q22',
  'description' => 'さんちゃんがなかなか覚えられなかった躾は？？？',
  'answer' => '待て',
  'choices' => ['お座り', '待て', 'お手', 'すべて覚える']
]
];
